<a href="https://colab.research.google.com/github/shaheenaparvin/Principles-Of-data-Science/blob/main/Pds_assignment2_Rcode.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext rpy2.ipython

The rpy2.ipython extension is already loaded. To reload it, use:
  %reload_ext rpy2.ipython

In [ ]:
%%R
library(dplyr)
cd <- read.csv("/content/cleaned_dataset.csv")
head(cd,5)

  Unnamed..0                             Name   Location Year Kilometers_Driven
1          1 Hyundai Creta 1.6 CRDi SX Option       Pune 2015             41000
2          2                     Honda Jazz V    Chennai 2011             46000
3          3                Maruti Ertiga VDI    Chennai 2012             87000
4          4  Audi A4 New 2.0 TDI Multitronic Coimbatore 2013             40670
5          6           Nissan Micra Diesel XV     Jaipur 2013             86999
  Fuel_Type Transmission Owner_Type Mileage Engine  Power Seats New_Price Price
1    Diesel       Manual      First   19.67   1582 126.20     5     20.54 12.50
2    Petrol       Manual      First   18.16   1199  88.70     5      8.61  4.50
3    Diesel       Manual      First   20.77   1248  88.76     7     20.54  6.00
4    Diesel    Automatic     Second   15.20   1968 140.80     5     20.54 17.74
5    Diesel       Manual      First   23.08   1461  63.10     5     20.54  3.50

In [ ]:
%%R
# Load the dplyr package
library(dplyr)

# Create a new feature representing the current age of the car
current_year <- 2024  # Current year
cd <- cd %>%
  mutate(Current_Age = current_year - Year)

#head(df$Current_Age)
glimpse(cd)

Rows: 5,847
Columns: 15
$ Unnamed..0        <int> 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, …
$ Name              <chr> "Hyundai Creta 1.6 CRDi SX Option", "Honda Jazz V", …
$ Location          <chr> "Pune", "Chennai", "Chennai", "Coimbatore", "Jaipur"…
$ Year              <int> 2015, 2011, 2012, 2013, 2013, 2016, 2013, 2012, 2018…
$ Kilometers_Driven <int> 41000, 46000, 87000, 40670, 86999, 36000, 64430, 659…
$ Fuel_Type         <chr> "Diesel", "Petrol", "Diesel", "Diesel", "Diesel", "D…
$ Transmission      <chr> "Manual", "Manual", "Manual", "Automatic", "Manual",…
$ Owner_Type        <chr> "First", "First", "First", "Second", "First", "First…
$ Mileage           <dbl> 19.67, 18.16, 20.77, 15.20, 23.08, 11.36, 20.54, 22.…
$ Engine            <dbl> 1582, 1199, 1248, 1968, 1461, 2755, 1598, 1248, 1462…
$ Power             <dbl> 126.20, 88.70, 88.76, 140.80, 63.10, 171.50, 103.60,…
$ Seats             <dbl> 5, 5, 7, 5, 5, 8, 5, 5, 5, 5, 5, 5, 5, 7, 5, 5, 5, 5…
$ New_Price         <dbl> 20.54, 8.61, 20.54, 20.54, 20.54, 20.54, 20.54, 20.5…
$ Price             <dbl> 12.50, 4.50, 6.00, 17.74, 3.50, 17.50, 5.20, 1.95, 9…
$ Current_Age       <dbl> 9, 13, 12, 11, 11, 8, 11, 12, 6, 12, 9, 10, 12, 10, …

In [ ]:
%%R

action_Select <- select(cd, Name, Year, Kilometers_Driven, New_Price)

head(action_Select,10)

                                  Name Year Kilometers_Driven New_Price
1     Hyundai Creta 1.6 CRDi SX Option 2015             41000     20.54
2                         Honda Jazz V 2011             46000      8.61
3                    Maruti Ertiga VDI 2012             87000     20.54
4      Audi A4 New 2.0 TDI Multitronic 2013             40670     20.54
5               Nissan Micra Diesel XV 2013             86999     20.54
6    Toyota Innova Crysta 2.8 GX AT 8S 2016             36000     20.54
7  Volkswagen Vento Diesel Comfortline 2013             64430     20.54
8       Tata Indica Vista Quadrajet LS 2012             65932     20.54
9                     Maruti Ciaz Zeta 2018             25692     10.65
10         Honda City 1.5 V AT Sunroof 2012             60000     20.54

In [ ]:
%%R
filtered_cd <- filter(cd, Year > 2015 ,Price > 10)
head(filtered_cd,10)

   Unnamed..0                                     Name   Location Year
1           7        Toyota Innova Crysta 2.8 GX AT 8S     Mumbai 2016
2          45                Toyota Corolla Altis G AT     Mumbai 2016
3          60        Toyota Innova Crysta 2.4 GX MT 8S     Mumbai 2017
4          67 Mercedes-Benz C-Class Progressive C 220d Coimbatore 2019
5          69          Hyundai Creta 1.4 E Plus Diesel     Mumbai 2018
6          92         Audi A6 2011-2015 35 TDI Premium Coimbatore 2018
7         110           Toyota Innova Crysta 2.8 ZX AT     Mumbai 2017
8         122         Hyundai Verna CRDi 1.6 SX Option    Kolkata 2018
9         131               Mahindra XUV500 AT W10 FWD     Jaipur 2016
10        134                 Mercedes-Benz SLC 43 AMG    Kolkata 2017
   Kilometers_Driven Fuel_Type Transmission Owner_Type Mileage Engine  Power
1              36000    Diesel    Automatic      First   11.36   2755 171.50
2              52001    Petrol    Automatic      First   14.28   1798 138.03
3              22000    Diesel       Manual      First   13.68   2393 147.80
4              15369    Diesel    Automatic      First    0.00   1950 107.35
5              13000    Diesel       Manual      First   22.10   1396  88.70
6              48367    Diesel    Automatic      First   17.68   1968 174.33
7              30000    Diesel    Automatic      First   11.36   2755 171.50
8              10250    Diesel       Manual      First   22.00   1582 126.20
9              54000    Diesel    Automatic      First   16.00   2179 107.35
10             13372    Petrol    Automatic      First   19.00   2996 362.07
   Seats New_Price Price Current_Age
1      8     20.54 17.50           8
2      5     20.54 10.11           8
3      8     19.34 16.50           7
4      5     49.14 35.67           5
5      5     11.81 10.50           6
6      5     20.54 39.58           6
7      7     20.54 19.25           7
8      5     14.44 10.95           6
9      7     20.54 13.25           8
10     2     95.04 54.00           7

In [ ]:
%%R
cd <- cd %>%
mutate(Price_Category = cut(Price, breaks = c(0, 5, 10, 15, 20, Inf), labels = c("0-5", "5-10", "10-15", "15-20", "20+")))

glimpse(cd)

Rows: 5,847
Columns: 16
$ Unnamed..0        <int> 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, …
$ Name              <chr> "Hyundai Creta 1.6 CRDi SX Option", "Honda Jazz V", …
$ Location          <chr> "Pune", "Chennai", "Chennai", "Coimbatore", "Jaipur"…
$ Year              <int> 2015, 2011, 2012, 2013, 2013, 2016, 2013, 2012, 2018…
$ Kilometers_Driven <int> 41000, 46000, 87000, 40670, 86999, 36000, 64430, 659…
$ Fuel_Type         <chr> "Diesel", "Petrol", "Diesel", "Diesel", "Diesel", "D…
$ Transmission      <chr> "Manual", "Manual", "Manual", "Automatic", "Manual",…
$ Owner_Type        <chr> "First", "First", "First", "Second", "First", "First…
$ Mileage           <dbl> 19.67, 18.16, 20.77, 15.20, 23.08, 11.36, 20.54, 22.…
$ Engine            <dbl> 1582, 1199, 1248, 1968, 1461, 2755, 1598, 1248, 1462…
$ Power             <dbl> 126.20, 88.70, 88.76, 140.80, 63.10, 171.50, 103.60,…
$ Seats             <dbl> 5, 5, 7, 5, 5, 8, 5, 5, 5, 5, 5, 5, 5, 7, 5, 5, 5, 5…
$ New_Price         <dbl> 20.54, 8.61, 20.54, 20.54, 20.54, 20.54, 20.54, 20.5…
$ Price             <dbl> 12.50, 4.50, 6.00, 17.74, 3.50, 17.50, 5.20, 1.95, 9…
$ Current_Age       <dbl> 9, 13, 12, 11, 11, 8, 11, 12, 6, 12, 9, 10, 12, 10, …
$ Price_Category    <fct> 10-15, 0-5, 5-10, 15-20, 0-5, 15-20, 5-10, 0-5, 5-10…

In [ ]:
%%R

arranged_df <- arrange(cd, desc(New_Price))

head(arranged_df)

  Unnamed..0                              Name   Location Year
1       5009 Audi Q7 45 TDI Quattro Technology       Pune 2017
2        418    Mercedes-Benz GLC 43 AMG Coupe Coimbatore 2018
3        264            Mercedes-Benz GLE 350d Coimbatore 2017
4       1690            Mercedes-Benz GLE 350d Coimbatore 2018
5       1830            Mercedes-Benz GLE 350d Coimbatore 2017
6       2767            Mercedes-Benz GLE 350d Coimbatore 2018
  Kilometers_Driven Fuel_Type Transmission Owner_Type Mileage Engine  Power
1             59500    Diesel    Automatic      First   14.75   2967 107.35
2             22397    Petrol    Automatic      First   11.50   2996 107.35
3             29819    Diesel    Automatic      First   11.57   2987 254.79
4             40129    Diesel    Automatic      First   11.57   2987 254.79
5             33552    Diesel    Automatic      First   11.57   2987 254.79
6             30706    Diesel    Automatic      First   11.57   2987 254.79
  Seats New_Price Price Current_Age
1     7     99.92 68.00           7
2     5     95.38 70.99           6
3     5     95.13 61.29           7
4     5     95.13 70.80           6
5     5     95.13 64.87           7
6     5     95.13 59.29           6

In [ ]:
%%R
summary_df <- cd %>%
  group_by(Name) %>%
  summarize(Avg_Price = mean(Price), Max_Price = max(Price))

summary_df

# A tibble: 1,804 × 3
   Name                                       Avg_Price Max_Price
   <chr>                                          <dbl>     <dbl>
 1 Ambassador Classic Nova Diesel                  1.35      1.35
 2 Audi A3 35 TDI Attraction                      16.5      16.5
 3 Audi A3 35 TDI Premium                         19.2      19.2
 4 Audi A3 35 TDI Premium Plus                    18.9      18.9
 5 Audi A3 35 TDI Technology                      22.5      22.5
 6 Audi A4 1.8 TFSI                                9         9.5
 7 Audi A4 1.8 TFSI Technology Edition            17.5      17.5
 8 Audi A4 2.0 TDI                                15.2      24
 9 Audi A4 2.0 TDI 177 Bhp Premium Plus           20.0      25.8
10 Audi A4 2.0 TDI 177 Bhp Technology Edition     25.5      26
# ℹ 1,794 more rows
# ℹ Use `print(n = ...)` to see more rows